//--------------------------------------------------------------------------------------------------
// Автор    : Пятышев Иван, 2006
// Описание : Вспомогательные функции для работы с объектами Source
//--------------------------------------------------------------------------------------------------

#ifndef P3_CORE_HELPERS_H
#define P3_CORE_HELPERS_H

namespace core
{

//--------------------------------------------------------------------------------------------------
class CHelpers
{
public:

	// Найти поле по внешнему имени (например, это "Tick" в случае DEFINE_INPUTFUNC( FIELD_FLOAT, "Tick", InputTick )
	static typedescription_t* FindField(CBaseEntity* pEnt, const char* szExternalName);

};

//--------------------------------------------------------------------------------------------------

#define INCHES_TO_METERS( X ) ( X * 0.0254f )
#define METERS_TO_INCHES( X ) ( X / 0.0254f )

#define FEETS_TO_METERS( X ) ( X * 0.3048f )
#define METERS_TO_FEETS( X ) ( X / 0.3048f )

//--------------------------------------------------------------------------------------------------

#define MAKE_SIMPLE_CONVAR( NAME, VAL ) static ConVar NAME( #NAME, VAL );

//--------------------------------------------------------------------------------------------------

}

#endif
