//------------------------------------------------------------------------------
// Desc    : Базовые классы объектов, smart-указатели
// Author  : Пятышев Иван, 2006
//------------------------------------------------------------------------------

#include "cbase.h"
#include "corePointers.h"

namespace core
{

//--------------------------------------------------------------------------------------------------
// CRefObject
//--------------------------------------------------------------------------------------------------
void CRefObject::Release ()
{
	if (--m_nCount == 0)
		delete this;
}
//--------------------------------------------------------------------------------------------------
CRefObject::~CRefObject()
{
	// нельзя удалять объекты классов-наследников от CRefObject с помощью delete.
	assert(m_nCount == 0);

	// объект удаляется, известить все weak-указатели
	if (m_list)
	{
		m_list->ClearAll();
		m_list = 0;
	}
}
//--------------------------------------------------------------------------------------------------
void CRefObject::AddWeakPointer(SWeakData* pNew)
{
	if (0 == m_list)
	{
		// список был пуст

		m_list = pNew;
		pNew->next = pNew->prev = 0;

		return;
	}

	// на этот объект уже ссылается хотя бы один weak-указатель

	if (m_list->next != 0)
		m_list->next->prev = pNew;

	pNew->prev = m_list;
	pNew->next = m_list->next;

	m_list->next = pNew;
}
//--------------------------------------------------------------------------------------------------
void CRefObject::RemoveWeakPointer(SWeakData* p)
{
	if (p == m_list)
	{
		// удаляемый элемент является началом списка
		m_list = p->next;
	}

	p->RemoveSelf();
}
//--------------------------------------------------------------------------------------------------
// SWeakData
//--------------------------------------------------------------------------------------------------
// удалить себя из текущего списка, связать ссылки next и prev
void SWeakData::RemoveSelf()
{
	if (prev != 0)
		prev->next = next;

	if (next != 0)
		next->prev = prev;

	next = prev = 0;
	data = 0;
}
//--------------------------------------------------------------------------------------------------
// разорвать все связи списка, обнулить все data
void SWeakData::ClearAll()
{
	SWeakData* p = this;

	while (p != 0)
	{
		SWeakData* pTemp = p->next;
		p->RemoveSelf();
		p = pTemp;
	}
}
//--------------------------------------------------------------------------------------------------

}
